{
  "quizName": "Adaptive Practice Quiz",
  "generatedFor": "Blake",
  "generatedAt": "2026-01-07_13-29-23",
  "focusAreas": [
    "evolution-lines",
    "lucario-analysis",
    "dual-type-mechanics",
    "gyarados-analysis",
    "eevee-eeveelutions",
    "gardevoir-analysis",
    "gengar-analysis",
    "type-fire-water-grass",
    "pikachu-analysis",
    "charizard-analysis",
    "regional-variants",
    "battle-role-tank",
    "battle-role-attacker"
  ],
  "format": "19 multiple choice + 1 short answer = 20 total questions",
  "questionDistribution": {
    "weakAreas": "70% (13 questions: Q1-Q16 excluding Q17-Q19)",
    "notYetTested": "5% (1 question: Q17)",
    "strongAreaReview": "10% (2 questions: Q18-Q19)"
  },
  "answers": {
    "q1": {
      "correct": "b",
      "topic": "evolution-lines",
      "explanation": "The Water starter evolution line is Squirtle → Wartortle → Blastoise, following the standard base → stage 1 → stage 2 progression."
    },
    "q2": {
      "correct": "b",
      "topic": "lucario-analysis",
      "explanation": "Lucario (Fighting/Steel) is weak to Fire (hits Steel), Fighting (hits Steel, though Fighting resists Fighting), and Ground (hits Steel). Steel's weaknesses are Fire, Fighting, and Ground."
    },
    "q3": {
      "correct": "b",
      "topic": "dual-type-mechanics",
      "explanation": "Psychic is super-effective against Poison (2x), but neutral to Grass. Venusaur takes 2x damage from Psychic because of its Poison typing, not Grass."
    },
    "q4": {
      "correct": "b",
      "topic": "gyarados-analysis",
      "explanation": "Flying-type Pokemon are immune to Ground-type attacks. This immunity overrides any weakness that Water might have to Ground, so Gyarados takes 0 damage from Ground."
    },
    "q5": {
      "correct": "b",
      "topic": "eevee-eeveelutions",
      "explanation": "Sylveon is the Fairy-type Eeveelution introduced in Generation 6. The other options (Pikachu, Lucario, Gardevoir) are not evolutions of Eevee."
    },
    "q6": {
      "correct": "b",
      "topic": "evolution-lines",
      "explanation": "The standard terminology for evolution stages is Base (unevolved), Stage 1 (first evolution), and Stage 2 (final evolution)."
    },
    "q7": {
      "correct": "b",
      "topic": "dual-type-mechanics",
      "explanation": "When one type resists (0.5x) and the other is weak (2x), they multiply: 0.5 × 2 = 1x, resulting in normal damage. The effects cancel out."
    },
    "q8": {
      "correct": "c",
      "topic": "pikachu-analysis",
      "explanation": "Electric is super-effective against both Water and Flying. Gyarados (Water/Flying) takes 4x damage from Electric attacks like Pikachu's Thunderbolt."
    },
    "q9": {
      "correct": "a",
      "topic": "charizard-analysis",
      "explanation": "Charizard (Fire/Flying) is weak to Water (hits Fire for 2x) and Electric (hits Flying for 2x). Ground doesn't affect Charizard due to Flying immunity."
    },
    "q10": {
      "correct": "b",
      "topic": "regional-variants",
      "explanation": "Regional variants are the same Pokemon species that have adapted differently in different regions, often gaining new types (e.g., Alolan Vulpix is Ice instead of Fire)."
    },
    "q11": {
      "correct": "a",
      "topic": "gardevoir-analysis",
      "explanation": "Gardevoir's Psychic type beats Fighting and Poison. Its Fairy type beats Fighting, Dragon, and Dark. Fighting and Dragon are correct offensive targets."
    },
    "q12": {
      "correct": "b",
      "topic": "gengar-analysis",
      "explanation": "A speedster (or speed sweeper) is a Pokemon with high Speed that attacks first and aims to KO opponents quickly before they can strike back. Gengar exemplifies this role."
    },
    "q13": {
      "correct": "b",
      "topic": "type-fire-water-grass",
      "explanation": "Grass beats Water in the starter triangle. Venusaur's Grass-type attacks would be super-effective against Blastoise's Water typing."
    },
    "q14": {
      "correct": "c",
      "topic": "battle-role-tank",
      "explanation": "Snorlax is the quintessential Tank/Wall with its massive HP stat, allowing it to absorb many hits. Gengar is too frail, Pikachu is a speedster, and Charizard is a sweeper."
    },
    "q15": {
      "correct": "b",
      "topic": "battle-role-attacker",
      "explanation": "An Attacker/Sweeper's primary goal is to deal high damage and knock out opposing Pokemon as quickly as possible, often using type advantages and high offensive stats."
    },
    "q16": {
      "correct": "b",
      "topic": "lucario-analysis",
      "explanation": "Lucario is described as a balanced attacker because it can effectively use both physical and special moves, making it versatile in offensive strategies."
    },
    "q17": {
      "correct": "b",
      "topic": "pokedex-basics",
      "explanation": "The Pokedex is a digital encyclopedia containing comprehensive information about Pokemon including type, stats, abilities, and general data."
    },
    "q18": {
      "correct": "b",
      "topic": "type-electric-flying",
      "explanation": "Electric-type moves are super-effective against Water and Flying types. This is why Gyarados (Water/Flying) has a devastating 4x Electric weakness."
    },
    "q19": {
      "correct": "b",
      "topic": "snorlax-analysis",
      "explanation": "Fighting is the only type super-effective against Normal. Ghost-types are actually immune to Normal attacks (no damage), while Normal is immune to Ghost."
    },
    "q20": {
      "type": "short_answer",
      "topic": "dual-type-mechanics",
      "keyPoints": [
        "Charizard has TWO types (Fire and Flying) that are BOTH weak to Rock",
        "When both types share a weakness, the damage multiplies: 2x × 2x = 4x damage",
        "Blastoise is a single-type Pokemon (Water only), and Water is neutral to Rock (1x damage)",
        "Dual-type mechanics mean weaknesses can stack (multiply) or cancel out based on both types",
        "This is why dual-types can have devastating 4x weaknesses that single-types cannot have"
      ],
      "sampleAnswer": "Charizard takes 4x damage from Rock because it is a dual-type Pokemon (Fire/Flying), and BOTH Fire and Flying are weak to Rock. When calculating damage for dual-types, the multipliers are multiplied together: 2x (Fire's weakness) × 2x (Flying's weakness) = 4x total damage. Blastoise, on the other hand, is only a Water type. Since Water is neither weak nor resistant to Rock, Rock attacks deal normal (1x) damage. This demonstrates how dual-types can have extreme vulnerabilities (4x weaknesses) that single-type Pokemon don't experience."
    }
  },
  "totalPoints": {
    "multipleChoice": 19,
    "shortAnswer": 2,
    "total": 21
  },
  "grading": {
    "multipleChoice": "1 point each (19 total)",
    "shortAnswer": "0-2 points (2 = explains both the 4x mechanic for Charizard AND why Blastoise takes 1x, 1 = partial explanation, 0 = incorrect or missing)"
  }
}
